blog/vagrant-guide.org
#+TITLE: Langkah-langkah Setup dan Konfigurasi Vagrant - @kholidfu
#+AUTHOR: Kholid Fuadi
#+DATE: <2015-10-17 Sat>
#+HTML_HEAD: <link rel="stylesheet" type="text/css" href="../stylesheet.css" />
#+STARTUP: indent

Langkah-langkah:
- install virtualbox
  #+BEGIN_SRC sh
  sudo apt-get install virtualbox virtualbox-dkms
  #+END_SRC
- install virtualbox-qt (/optional/ buat yang pengen vboxmanager versi GUI)
  #+BEGIN_SRC sh
  sudo apt-get install virtualbox-qt
  #+END_SRC
- install vagrant Beberapa artikel dari internet menyarankan jangan
  memasang /vagrant/ versi bawaan distro, karena biasanya ketinggalan
  versi. Sebaiknya unduh langsung dari situs vagrantup[fn:2]. Kemudian
  /install/ langsung.
  #+BEGIN_SRC sh
  sudo dpkg -i vagrant_1.x.x.ix86.deb
  #+END_SRC
- menambahkan box[fn:1]
  #+BEGIN_SRC sh
  vagrant box add ubuntu/trusty64
  #+END_SRC
- membuat direktori project
  #+BEGIN_SRC sh
  mkdir vagrant_project && cd vagrant_project
  vagrant init
  #+END_SRC
- sunting berkas =Vagrantfile=, ubah baris berikut
  #+BEGIN_SRC text
  config.vm.box = "base"
  #+END_SRC
  Sesuaikan dengan =box= yang Anda unduh, misal:
  #+BEGIN_SRC text
  config.vm.box = "ubuntu/trusty64"
  #+END_SRC
- Jalankan environment
  #+BEGIN_SRC sh
  vagrant up
  #+END_SRC
- Login via ssh
  #+BEGIN_SRC sh
  ssh vagrant@127.0.0.1 -p 2222
  #+END_SRC

Biar lebih efektif, =ssh= /command/ ini bisa ditambahkan ke =~/.bashrc=, misal:
#+BEGIN_SRC text
alias vm="ssh vagrant@127.0.0.1 -p 2222"
#+END_SRC

Kemudian jalankan =source ~/.bashrc= di terminal. Lain kali tinggal
jalankan =vm=, dan Anda sudah /logged-in/ ke /virtual machine/.

Mesin virtual ini dapat kita konfigurasi sesuai keinginan dengan
membuat /file/ bernama =Vagrantfile=. Berikut ini contoh isi dari
berkas tersebut:

#+BEGIN_SRC ruby
Vagrant.configure(2) do |config|
  config.vm.hostname = "banteng-server"
  config.vm.box = "ubuntu/trusty64"
  # port forwarding
  config.vm.network :forwarded_port, guest: 8000, host: 8000
  config.vm.provision :shell, :path => "provision/provision-ubuntu-14.04.sh"
  config.vm.synced_folder "../../git", "/vagrant_data"
  # fix stdin is not tty
  config.ssh.shell = "bash -c 'BASH_ENV=/etc/profile exec bash'"
end
#+END_SRC

\\
*References*:\\
- [[http://www.olindata.com/blog/2014/07/installing-vagrant-and-virtual-box-ubuntu-1404-lts][olindata.com]]

* Footnotes

[fn:2] https://www.vagrantup.com/downloads.html

[fn:1] Daftar =box= bisa dilihat disini: https://atlas.hashicorp.com/boxes/search
