blog/vagrant-guide.html
<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
"http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="en" xml:lang="en">
<head>
<title>Langkah-langkah Setup dan Konfigurasi Vagrant - @kholidfu</title>
<!-- 2016-11-02 Wed 06:41 -->
<meta  http-equiv="Content-Type" content="text/html;charset=utf-8" />
<meta  name="generator" content="Org-mode" />
<meta  name="author" content="Kholid Fuadi" />
<link rel="stylesheet" type="text/css" href="../stylesheet.css" />
</head>
<body>
<div id="content">
<h1 class="title">Langkah-langkah Setup dan Konfigurasi Vagrant - @kholidfu</h1>
<p>
Langkah-langkah:
</p>
<ul class="org-ul">
<li>install virtualbox
<div class="org-src-container">

<pre class="src src-sh">sudo apt-get install virtualbox virtualbox-dkms
</pre>
</div>
</li>
<li>install virtualbox-qt (<i>optional</i> buat yang pengen vboxmanager versi GUI)
<div class="org-src-container">

<pre class="src src-sh">sudo apt-get install virtualbox-qt
</pre>
</div>
</li>
<li>install vagrant Beberapa artikel dari internet menyarankan jangan
memasang <i>vagrant</i> versi bawaan distro, karena biasanya ketinggalan
versi. Sebaiknya unduh langsung dari situs vagrantup<sup><a id="fnr.1" name="fnr.1" class="footref" href="#fn.1">1</a></sup>. Kemudian
<i>install</i> langsung.
<div class="org-src-container">

<pre class="src src-sh">sudo dpkg -i vagrant_1.x.x.ix86.deb
</pre>
</div>
</li>
<li>menambahkan box<sup><a id="fnr.2" name="fnr.2" class="footref" href="#fn.2">2</a></sup>
<div class="org-src-container">

<pre class="src src-sh">vagrant box add ubuntu/trusty64
</pre>
</div>
</li>
<li>membuat direktori project
<div class="org-src-container">

<pre class="src src-sh">mkdir vagrant_project &amp;&amp; cd vagrant_project
vagrant init
</pre>
</div>
</li>
<li>sunting berkas <code>Vagrantfile</code>, ubah baris berikut
<div class="org-src-container">

<pre class="src src-text">config.vm.box = "base"
</pre>
</div>
<p>
Sesuaikan dengan <code>box</code> yang Anda unduh, misal:
</p>
<div class="org-src-container">

<pre class="src src-text">config.vm.box = "ubuntu/trusty64"
</pre>
</div>
</li>
<li>Jalankan environment
<div class="org-src-container">

<pre class="src src-sh">vagrant up
</pre>
</div>
</li>
<li>Login via ssh
<div class="org-src-container">

<pre class="src src-sh">ssh vagrant@127.0.0.1 -p 2222
</pre>
</div>
</li>
</ul>

<p>
Biar lebih efektif, <code>ssh</code> <i>command</i> ini bisa ditambahkan ke <code>~/.bashrc</code>, misal:
</p>
<div class="org-src-container">

<pre class="src src-text">alias vm="ssh vagrant@127.0.0.1 -p 2222"
</pre>
</div>

<p>
Kemudian jalankan <code>source ~/.bashrc</code> di terminal. Lain kali tinggal
jalankan <code>vm</code>, dan Anda sudah <i>logged-in</i> ke <i>virtual machine</i>.
</p>

<p>
Mesin virtual ini dapat kita konfigurasi sesuai keinginan dengan
membuat <i>file</i> bernama <code>Vagrantfile</code>. Berikut ini contoh isi dari
berkas tersebut:
</p>

<div class="org-src-container">

<pre class="src src-ruby">Vagrant.configure(2) do |config|
  config.vm.hostname = "banteng-server"
  config.vm.box = "ubuntu/trusty64"
  # port forwarding
  config.vm.network :forwarded_port, guest: 8000, host: 8000
  config.vm.provision :shell, :path =&gt; "provision/provision-ubuntu-14.04.sh"
  config.vm.synced_folder "../../git", "/vagrant_data"
  # fix stdin is not tty
  config.ssh.shell = "bash -c 'BASH_ENV=/etc/profile exec bash'"
end
</pre>
</div>

<p>
\\
<b>References</b>:<br  />
</p>
<ul class="org-ul">
<li><a href="http://www.olindata.com/blog/2014/07/installing-vagrant-and-virtual-box-ubuntu-1404-lts">olindata.com</a>
</li>
</ul>
<div id="footnotes">
<h2 class="footnotes">Footnotes: </h2>
<div id="text-footnotes">

<div class="footdef"><sup><a id="fn.1" name="fn.1" class="footnum" href="#fnr.1">1</a></sup> <p class="footpara">
<a href="https://www.vagrantup.com/downloads.html">https://www.vagrantup.com/downloads.html</a>
</p></div>

<div class="footdef"><sup><a id="fn.2" name="fn.2" class="footnum" href="#fnr.2">2</a></sup> <p class="footpara">
Daftar <code>box</code> bisa dilihat disini: <a href="https://atlas.hashicorp.com/boxes/search">https://atlas.hashicorp.com/boxes/search</a>
</p></div>


</div>
</div></div>
<div id="postamble" class="status">
<p class="date">Date: <span class="timestamp-wrapper"><span class="timestamp">&lt;2015-10-17 Sat&gt;</span></span></p>
<p class="author">Author: Kholid Fuadi</p>
<p class="date">Created: 2016-11-02 Wed 06:41</p>
<p class="creator"><a href="http://www.gnu.org/software/emacs/">Emacs</a> 25.1.1 (<a href="http://orgmode.org">Org</a> mode 8.2.10)</p>
<p class="validation"><a href="http://validator.w3.org/check?uri=referer">Validate</a></p>
</div>
</body>
</html>
